text = [1,2,3,4,5,6,7]
print("Значение по умолчанию — index=-1, удаление последнего символа:", text.pop())
print("Удаление первого символа:", text.pop(0))
print("Остальные символы:", text, "\n")

text = [1,2,3,4,5,6,7]
print("Значение по умолчанию — index=-1, удаление последнего символа:", text.pop())
print("Удаление второго символа:", text.pop(1))
print("Остальные символы:", text, "\n")

text = [1,2,3,4,5,6,7]
print("Значение по умолчанию — index=-1, удаление последнего символа:", text.pop())
print("Удаление пятого символа:", text.pop(4))
print("Остальные символы:", text, "\n")
